app/controllers/admin/articles_controller.rb

	def create

		@article = Article.new(article_params)
		@article.save
---
INSERT INTO `articles` (`title`, `short_desc`, `long_desc`, `status`, `created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`) VALUES ('Aspernatur veniam rerum est ea ut sit molestiae dolorem', 'Omnis minim incidunt omnis odio consectetur fugiat omnis', 'A totam tempore minima perspiciatis distinctio Quas vel', 'Active', '2017-06-20 07:43:27', '2017-06-20 07:43:27', 'grade.png', 'image/png', 221729, '2017-06-20 07:43:25')

	def update
		@article = Article.find(params[:id])
		@article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 1 LIMIT 1
UPDATE `articles` SET `image_file_name` = 'chandragiri.png', `image_content_type` = 'image/png', `image_file_size` = 638994, `image_updated_at` = '2017-06-20 10:36:34', `updated_at` = '2017-06-20 10:36:35' WHERE `articles`.`id` = 4