app/controllers/roseblogs_controller.rb

	def index
		@articles=Article.all
---
SELECT `articles`.* FROM `articles` WHERE (status == 'active')